In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
a=pd.DataFrame(np.arange(12).reshape(3,4))
a

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [4]:
b=pd.DataFrame(np.arange(20).reshape(4,5))
b

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [5]:
a + b

      0     1     2     3   4
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [6]:
a*b

      0     1      2      3   4
0   0.0   1.0    4.0    9.0 NaN
1  20.0  30.0   42.0   56.0 NaN
2  80.0  99.0  120.0  143.0 NaN
3   NaN   NaN    NaN    NaN NaN

In [7]:
b.add(a,fill_value=100)

       0      1      2      3      4
0    0.0    2.0    4.0    6.0  104.0
1    9.0   11.0   13.0   15.0  109.0
2   18.0   20.0   22.0   24.0  114.0
3  115.0  116.0  117.0  118.0  119.0

In [8]:
a.mul(b,fill_value=0)

      0     1      2      3    4
0   0.0   1.0    4.0    9.0  0.0
1  20.0  30.0   42.0   56.0  0.0
2  80.0  99.0  120.0  143.0  0.0
3   0.0   0.0    0.0    0.0  0.0

In [9]:
c=pd.Series(np.arange(4))
c

0    0
1    1
2    2
3    3
dtype: int32

In [10]:
c-10

0   -10
1    -9
2    -8
3    -7
dtype: int32

In [11]:
b-c
# 默认运算发生在1轴上

      0     1     2     3   4
0   0.0   0.0   0.0   0.0 NaN
1   5.0   5.0   5.0   5.0 NaN
2  10.0  10.0  10.0  10.0 NaN
3  15.0  15.0  15.0  15.0 NaN

In [12]:
b.sub(c,axis=0)

    0   1   2   3   4
0   0   1   2   3   4
1   4   5   6   7   8
2   8   9  10  11  12
3  12  13  14  15  16

In [13]:
a=pd.DataFrame(np.arange(12).reshape(3,4))

In [14]:
d=pd.DataFrame(np.arange(12,0,-1).reshape(3,4))

In [15]:
print(a)
print(b)

0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11
    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [16]:
a>d

       0      1      2      3
0  False  False  False  False
1  False  False  False   True
2   True   True   True   True

In [17]:
a==d

       0      1      2      3
0  False  False  False  False
1  False  False   True  False
2  False  False  False  False

In [18]:
a>c
# 不同维度，广播运算，默认在1轴

       0      1      2      3
0  False  False  False  False
1   True   True   True   True
2   True   True   True   True

In [19]:
c

0    0
1    1
2    2
3    3
dtype: int32

In [20]:
a

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [21]:
c>0

0    False
1     True
2     True
3     True
dtype: bool

In [22]:
d

    0   1   2  3
0  12  11  10  9
1   8   7   6  5
2   4   3   2  1

In [24]:
d.loc[:,3]

0    9
1    5
2    1
Name: 3, dtype: int32

In [25]:
d.iloc[:,1]

0    11
1     7
2     3
Name: 1, dtype: int32

In [26]:
d.loc[2,:]

0    4
1    3
2    2
3    1
Name: 2, dtype: int32